{"0": "0 is the year that nothing interesting came to pass.", "1": "1 is the year that Emperor Ping of Han China begins his reign and Wang Mang is re-instated as regent by Grand Empress Dowager Wang.", "2": "2 is the year that Gaius Caesar meets with Phraates V, the king of Parthia on the Euphrates.", "3": "3 is the year that the rule of emperor Augustus is renewed for a ten-year period.", "4": "4 is the year that Emperor Caesar Augustus summons Tiberius to Rome, and names him his heir and future emperor.", "5": "5 is the year that Tiberius conquers Germania Inferior.", "6": "6 is the year that Augustus banishes Agrippa Postumus, one of his adopted sons, to the island of Planasia.", "7": "7 is the year that Publius Quinctilius Varus is appointed governor of Germania.", "8": "8 is the year that Vipsania Julia is exiled.", "9": "9 is the year that Wang Mang founds the short-lived Xin Dynasty in China (until 25).", "10": "10 is the year that Publius Cornelius Dolabella is a Roman consul.", "11": "11 is the year that Artabanus II of the Arsacid Dynasty becomes ruler of Parthia.", "12": "12 is the year that the Armenian Artaxiad Dynasty is overthrown by the Romans.", "13": "13 is the year that Abgarus of Edessa is reinstalled as king of Osroene.", "14": "14 is the year that a census indicates that there are 4,973,000 Roman citizens.", "15": "15 is the year that Valerius Gratus is appointed Prefect of Iudaea.", "16": "16 is the year that Ovid's \"Epistulae ex Ponto\" appears.", "17": "17 is the year that Herod Antipas, son of Herod the Great, builds on the western shore of the Sea of Galilee, the city Tiberias in honor of Tiberius.", "18": "18 is the year that a vexillatio (sub-unit) of Legio III Augusta is destroyed by an ambush in Africa.", "19": "19 is the year that Maroboduus, king of the Marcomanni, is deposed by Catualda.", "20": "20 is the year that Servius Sulpicius Galba is a Roman praetor.", "21": "21 is the year that the Romans create a buffer state in the territory of the Quadi in southern Slovakia.", "22": "22 is the year that the consuls are Decimus Haterius Agrippa and Gaius Sulpicius Galba.", "23": "23 is the year that Liu Xuan, a descendant of the Han Dynasty royal family and leader of insurgents against the Xin Dynasty, proclaims himself emperor against Wang Mang.", "24": "24 is the year that Philo declares that the Old Testament is the eternal law of God.", "25": "25 is the year that the Han dynasty is restored in China as Liu Xiu proclaims himself Emperor, starting the Jianwu era (until 56).", "26": "26 is the year that Emperor Tiberius retires to Capri, leaving the Praetorian Guard under Lucius Aelius Sejanus in charge of the Roman Empire and the city of Rome.", "27": "27 is the year that Lucius Calpurnius Piso and Marcus Licinius Crassus Frugi become Roman consuls.", "28": "28 is the year that the Frisians negotiate a treaty with the Romans at the River Rhine, avoiding conquest.", "29": "29 is the year that Agrippina the Elder is exiled to the island of Pandataria, and her sons (except Caligula) are imprisoned by Lucius Aelius Sejanus.", "30": "30 is the year that the Sermon on the Mount (according to proponents of the 33 theory, although 27 or 28 is more likely).", "31": "31 is the year that Naevius Sutorius Macro becomes the leader of the Praetorian Guard after Sejanus is executed.", "32": "32 is the year that Symbolic interpretation of the OT by Philo (Allegory).", "33": "33 is the year that Emperor Tiberius founds a credit bank in Rome.", "34": "34 is the year that Naevius Sutorius Macro is said to gain favour in the empire by prostituting his wife Eunius to Caligula.", "35": "35 is the year that Pliny the Elder is brought to Rome before this year.", "36": "36 is the year that Herod Antipas suffers major losses in a war with Aretas IV of Nabatea, provoked partly by Antipas' divorce of Aretas' daughter.", "37": "37 is the year that an earthquake destroys Antioch on April 9th.", "38": "38 is the year that Phaedrus writes his popular collection of fables.", "39": "39 is the year that Philo leads a Jewish delegation to Rome to protest the anti-Jewish conditions in Alexandria.", "40": "40 is the year that the emperor Caligula is consul without colleague.", "41": "41 is the year that Claudius makes Agrippa king of Judea.", "42": "42 is the year that the territories of the current Algeria and Morocco become a Roman province.", "43": "43 is the year that the Romans now have complete control of the Mediterranean.", "44": "44 is the year that Judaea is controlled by Roman governors.", "45": "45 is the year that Salzburg (Juvavum) is awarded the status of a Roman municipium.", "46": "46 is the year that a drought and an invasion of locusts hit the Mongolian steppes, causing a famine and a revolt at Xiongnu.", "47": "47 is the year that Gnaeus Domitius Corbulo is made commander of the Roman army in Germania Inferior, he conquers the Chauci and fights against the Cherusci and Frisians.", "48": "48 is the year that Vitellius is a Roman Consul.", "49": "49 is the year that Nero becomes engaged to Claudia Octavia, daughter of Claudius.", "50": "50 is the year that the distinction between chronic maladies and acute illnesses is made by Thessalos.", "51": "51 is the year that the New Testament book 1 Thessalonians is written (possible date).", "52": "52 is the year that Emperor Claudius attempts to control the Fucine Lake by digging a 5,6 km tunnel through Monte Salviano, requiring 30,000 workers and eleven years.", "53": "53 is the year that Nero marries Claudia Octavia.", "54": "54 is the year that Corbulo inspects in Syria a base of Legio X Fretensis at Cyrrhus, the Roman legionnaires are demoralized by a \"long peace\".", "55": "55 is the year that the Roman jurist Sabinus writes three books on the rights of citizens.", "56": "56 is the year that Publius Clodius Thrasea Paetus becomes a consul in Rome.", "57": "57 is the year that a Japanese king sends an ambassador to China.", "58": "58 is the year that the apostle Paul is arrested in Jerusalem, and is imprisoned in Caesarea.", "59": "59 is the year that Paul the Apostle pleads his case and testifies of Christianity before king Agrippa II.", "60": "60 is the year that Paul of Tarsus journeys to Rome, but is shipwrecked at Malta.", "61": "61 is the year that Publius Petronius Turpilianus and Lucius Caesennius Paetus become Roman consuls.", "62": "62 is the year that Lucan writes a history of the conflict between Julius Caesar and Pompey.", "63": "63 is the year that Aulus Cornelius Celsus writes a dictionary (encyclopedia) on the arts and sciences.", "64": "64 is the year that the year the First Epistle of Peter is traditionally believed to be written.", "65": "65 is the year that the Gospel of Matthew is probably written between 60 and this year.", "66": "66 is the year that the Zealots lay siege on Jerusalem and annihilate the Roman garrison (a cohort of Legio III).", "67": "67 is the year that Nero, jealous of the success of Corbulo in Armenia, orders that he be put to death.", "68": "68 is the year that the Roman Senate accepts emperor Galba on June 8th.", "69": "69 is the year that Legio I Macriana liberatrix is disbanded.", "70": "70 is the year that the Third Wall of Jerusalem collapse and the Jews withdrew from Bezetha to the Second Wall, where the defences are unorganized on May 25th.", "71": "71 is the year that Mithraism begins to spread throughout the Roman Empire.", "72": "72 is the year that the Romans lay siege to Masada, a desert fortress held by Jewish victims of the Sicarii.", "73": "73 is the year that Pliny the Elder serves as procurator in Hispania Tarraconensis.", "74": "74 is the year that the Black Forest region is reattached to the Roman Empire.", "75": "75 is the year that Caerwent is founded by the Romans as the market town of Venta Silurum, a settlement of the Silures.", "76": "76 is the year that Emperor Vespasianus Augustus and Titus Caesar Vespasianus become Roman Consul.", "77": "77 is the year that a Roman squadron, sent by Agricola, explores the north of Scotland for the first time, discovering the Orkney and Shetland Islands.", "78": "78 is the year that this is the base year (year zero) of the Saka era used by some Hindu calendars, the Indian national calendar, and the Cambodian Buddhist calendar.", "79": "79 is the year that Emperor Titus dedicates the famous Roman Colosseum.", "80": "80 is the year that the aeolipile, the first steam engine, is described by Hero of Alexandria.", "81": "81 is the year that the Arch of Titus is constructed.", "82": "82 is the year that Gnaeus Julius Agricola raises a fleet and encircles the Celtic tribes beyond the Forth, the Caledonians rise in great numbers against the Romans.", "83": "83 is the year that Inchtuthil, Roman fort built in Scotland.", "84": "84 is the year that Pliny the Younger is sevir equitum Romanorum (commander of a cavalry squadron).", "85": "85 is the year that Emperor Domitian repulses a Dacian invasion of Moesia.", "86": "86 is the year that Germany is divided into two provinces, Upper Germany and Lower Germany.", "87": "87 is the year that Decebalus becomes king of Dacia.", "88": "88 is the year that Pope Clement I succeeds Pope Anacletus I as the fourth pope.", "89": "89 is the year that Legio XIII Gemina is transferred to Dacia to help in the war against Decebalus.", "90": "90 is the year that Emperor Domitian and Nerva are Roman Consuls.", "91": "91 is the year that Rome is described by Statius in his poems.", "92": "92 is the year that the Roman army moves into Mesopotamia.", "93": "93 is the year that the Xianbei incorporates 100,000 Xiongnu in Mongolian steppe.", "94": "94 is the year that the Roman poet Statius retires to Naples from Rome.", "95": "95 is the year that Manius Acilius Glabrio is commanded by Domitian to descend into the arena of the Colosseum to fight a lion.", "96": "96 is the year that Marcus Ulpius Traianus becomes governor of Upper Germany.", "97": "97 is the year that the Roman colony of Cuicul is started in Numidia.", "98": "98 is the year that the silver content of the Roman denarius rises to 93 percent under emperor Trajan, up from 92 percent under Domitian.", "99": "99 is the year that nothing remarkable happened.", "100": "100 is the year that Main hall, Markets of Trajan, Rome, is made (until 112)."}