{"2": "2 is the year that the Chinese census shows nearly one million people living in Vietnam.", "3": "3 is the year that the rule of emperor Augustus is renewed for a ten-year period.", "5": "5 is the year that Agrippina the Elder marries Germanicus, her second cousin.", "7": "7 is the year that Publius Quinctilius Varus is appointed governor of Germania.", "11": "11 is the year that Emperor Augustus abandons his plan to create a defensive border at the Elbe, in order to reinforce the Roman defense along the Rhine and the Danube.", "13": "13 is the year that the Senate passes a senatus consultum restricting the reduced Vigintisexviri to the Ordo Equester.", "17": "17 is the year that an earthquake in Anatolia destroys the city of Sardis.", "19": "19 is the year that Maroboduus, king of the Marcomanni, is deposed by Catualda.", "23": "23 is the year that Lucius Aelius Sejanus begins to dominate the Roman Senate and Tiberius, after the death of Drusus.", "29": "29 is the year that the Romans capture Serdica (modern Sofia), named after the Celtic tribe the Serdi.", "31": "31 is the year that Tiberius returns to Rome from Capri.", "43": "43 is the year that the Romans now have complete control of the Mediterranean.", "47": "47 is the year that Paul starts his evangelistic work.", "53": "53 is the year that Evodius succeeds Saint Peter as Patriarch of Antioch.", "59": "59 is the year that Gnaeus Domitius Corbulo, Roman commander in the east, captures Tigranocerta in Mesopotamia.", "61": "61 is the year that the Druidic stronghold of Anglesey in north Wales is attacked and destroyed by Suetonius Paulinus (Tacitus, Annals xiv 30).", "67": "67 is the year that Siege of Jotapata and massacre of its 40,000 Jewish inhabitants.", "71": "71 is the year that Titus is awarded with a triumph, accompanied by Vespasian and his brother Titus Flavius Domitian.", "73": "73 is the year that Titus Flavius Domitianus becomes Roman Consul.", "79": "79 is the year that Agricola founds Mamucium, a frontier fort and settlement in the North West of England.", "83": "83 is the year that Inchtuthil, Roman fort built in Scotland.", "89": "89 is the year that Aquincum (old Budapest, Óbuda) is founded.", "97": "97 is the year that the Roman colony of Cuicul is started in Numidia.", "101": "101 is the year that the Tibetans introduce their Buddhist Religion into Indonesia.", "103": "103 is the year that Emperor Trajan and Manius Laberius Maximus become Roman Consul.", "107": "107 is the year that Emperor Trajan divides Pannonia into two portions sometime between 102 and this year.", "109": "109 is the year that the Christian Church proclaims itself to be universal (catholic).", "113": "113 is the year that Trajan builds Trajan's Column near the Colosseum in Rome to commemorate his victory over the Dacians in the Second Dacian War.", "127": "127 is the year that Emperor Hadrian returns to Rome after a seven year voyage to the Roman provinces.", "131": "131 is the year that Emperor Hadrian builds the city Aelia Capitolina on the location of Jerusalem.", "137": "137 is the year that Wang Yun, Chinese Prime Minister, plotted Dong Zhuo's assassination and was successful.", "139": "139 is the year that Antoninus Augustus Pius and Caius Bruttius Praesens become Roman Consuls.", "149": "149 is the year that nothing remarkable happened.", "151": "151 is the year that Detail from a rubbing of a stone relief in Wu family shrine (Wuliangci), Jiaxiang, Shandong, is made.", "157": "157 is the year that La Mojarra Stela 1 in Mesoamerica is produced.", "163": "163 is the year that Statius Priscus reconquers Armenia; Artaxata is ruined.", "167": "167 is the year that the Germans devastate the Balkans and ransack the sanctuary of Eleusis, near Athens.", "173": "173 is the year that Gnaeus Claudius Severus and Tiberius Claudius Pompeianus become Roman Consuls.", "179": "179 is the year that the Roman fort Castra Regina (\"fortress by the Regen river\") is built at Regensburg, on the right bank of the Danube in Germany.", "181": "181 is the year that Imperator Lucius Aurelius Commodus and Lucius Antistius Burrus become Roman Consuls.", "191": "191 is the year that Commodus as Hercules, from Esquiline Hill, Rome, is made on C. 191–192 NaNth.", "193": "193 is the year that Septimius Severus defeats the army under Pescennius at the Battle of Cyzicus and Battle of Nicaea (Asia Minor).", "197": "197 is the year that Septimius Severus forms new naval units, manning all the triremes in Italy with heavily armed troops for war in the East.", "199": "199 is the year that Pope Zephyrinus succeeds Pope Victor I as the fifteenth pope.", "211": "211 is the year that Mark is succeeded by Philadelphus as Patriarch of Constantinople.", "223": "223 is the year that nothing remarkable happened.", "227": "227 is the year that Seius Sallustius is executed for the attempted murder of his son-in-law Emperor Alexander Severus.", "229": "229 is the year that Ammonius Saccas renews Greek philosophy by creating Neoplatonism.", "233": "233 is the year that Emperor Alexander Severus celebrates a triumph in Rome to observe his \"victory\" the previous year over the Persians.", "239": "239 is the year that Origen publishes the Old Testament in five languages.", "241": "241 is the year that the Battle of Samhain is fought in Ireland on November 1st.", "251": "251 is the year that Pope Cornelius succeeds Pope Fabian as the 21st pope on March NaNth.", "257": "257 is the year that the Goths separate into the Ostrogoths and the Visigoths.", "263": "263 is the year that the Wei Kingdom conquers the kingdom of Shu Han, one of the Chinese Three Kingdoms.", "269": "269 is the year that the Heruli capture Athens and raid the Aegean Islands as far as Crete and Rhodes.", "271": "271 is the year that Victorinus, Emperor of the Gallic Empire, is assassinated by Attitianus, reportedly for reasons of personal revenge.", "277": "277 is the year that Probus enters Rome to have his position as Emperor ratified by the Senate.", "281": "281 is the year that Emperor Probus returns to Rome, where he celebrates his triumph over the Vandals and the usurpers (Bonosus, Julius Saturninus and Proculus).", "283": "283 is the year that Pope Caius succeeds Pope Eutychian as the 28th pope on December 17th.", "293": "293 is the year that Emperor Diocletian and Maximian appoint Constantius Chlorus and Galerius as Caesars on March 1st.", "307": "307 is the year that Severus II is captured and imprisoned at Tres Tabernae on September 16th.", "311": "311 is the year that Maximinus II divides the Eastern Empire between co-emperor Licinius, and mobilished his army for a campaign in Asia Minor.", "313": "313 is the year that Nintoku, the fourth son of Ōjin, becomes the 16th emperor of Japan.", "317": "317 is the year that the earliest historically verified reference to tea is recorded, although the Chinese have been drinking the beverage for centuries.", "331": "331 is the year that Constantine I dedicated the Church of the Holy Apostles in Constantinople.", "337": "337 is the year that Constantine II, Constantius II, and Constans I succeed their father Constantine I as co-emperors on September 9th.", "347": "347 is the year that Li Shi, ruler of Cheng Han, failes in his attempt to halt an Jin expedition under Huan Wen.", "349": "349 is the year that the Mou-jong (proto-Mongols) take control of North China.", "353": "353 is the year that Wang Xizhi, Chinese calligrapher, produces \"Preface to the Poems Composed at the Orchid Pavilion\" in running script style.", "359": "359 is the year that Emperor Constantius II convenes the Council of Rimini to resolve the crisis over Arianism in the Church on July NaNth.", "367": "367 is the year that Eunomius of Cyzicus is banished to Mauretania for harbouring the usurper Procopius.", "373": "373 is the year that Saint Martin of Tours undertakes the Christianization of Gaul.", "379": "379 is the year that Niall becomes High King of Ireland.", "383": "383 is the year that Arcadius is elevated to Emperor on January 19th.", "389": "389 is the year that all pagan buildings in Alexandria, including the library, are destroyed by fire.", "397": "397 is the year that Mor Gabriel Monastery is founded and located on the Tur Abdin plateau near Midyat (Turkey).", "401": "401 is the year that Emperor Arcadius sends many gifts to the Hunnish chieftain Uldin in appreciation of his victory over the Goths and Gainas.", "409": "409 is the year that the Vandals, led by king Gunderic, cross the Pyrenees into the Iberian Peninsula on October 13th.", "419": "419 is the year that Jin Gongdi, age 33, succeeds his developmentally disabled brother Jin Andi as emperor of the Eastern Jin Dynasty.", "421": "421 is the year that Emperor Theodosius II marries Aelia Eudocia, a woman of Greek origin on June 7th.", "431": "431 is the year that Flavius Aetius, Roman general (magister militum), fights a campaign in Rhaetia (Switzerland) and Noricum (Austria).", "433": "433 is the year that Petronius Maximus is appointed consul of the Western Roman Empire.", "439": "439 is the year that the Vandals conquer Sicily, Sardinia, Corsica and the Balearic Islands on Winter NaNth.", "443": "443 is the year that Gunabhadra, Indian Buddhist monk, is a invited honored guest by emperor Wen of Liu Song (Liu Song Dynasty).", "449": "449 is the year that Maximus II becomes patriarch of Antioch.", "457": "457 is the year that Yazdegerd II dies after a 19-year reign.", "461": "461 is the year that Libius Severus, Roman senator from Lucania, is declared emperor of the Western Roman Empire on November 19th.", "463": "463 is the year that Childeric I, king of the Salian Franks, allies with the Roman general Aegidius against the Visigoths.", "467": "467 is the year that Anthemius becomes Emperor on April 12th.", "479": "479 is the year that the Song Dynasty ends and the Southern Qi Dynasty begins in southern China.", "487": "487 is the year that nothing remarkable happened.", "491": "491 is the year that Aelle of Sussex besieges and conquers the fortified town of Anderitum in southern Britain.", "499": "499 is the year that Kavadh I of Persia deposes his brother Djamasp and restores himself as king of Persia.", "503": "503 is the year that the Earth probably went around the Sun.", "509": "509 is the year that nothing remarkable happened.", "521": "521 is the year that Ma`adikarib Ya`fur conducts a military campaign in Mesopotamia.", "523": "523 is the year that Leptis Magna is sacked by Berber raiders.", "541": "541 is the year that the Uyghurs come under the rule of the Hephthalites.", "547": "547 is the year that Theodebald becomes king of Austrasia (or 548).", "557": "557 is the year that the Liang Dynasty ends and the Chen Dynasty begins in southern China; its first ruler is Chen Wu Di.", "563": "563 is the year that the synod of Braga declares Priscillianism a heresy.", "569": "569 is the year that the Nubian kingdom of Alodia is converted to Christianity, according to John of Ephesus.", "571": "571 is the year that the Monophysites again reject the Council of Chalcedon, causing another schism.", "577": "577 is the year that Hou Zhu is succeeded by You Zhu, then by Fan Yang Wang.", "587": "587 is the year that Sledda becomes king of Essex.", "593": "593 is the year that Altar to Amitabha Buddha is made.", "599": "599 is the year that the Chinese win the war at Ordos.", "601": "601 is the year that Liuva II succeeds his brother Reccared as King of the Visigoths.", "607": "607 is the year that Pope Boniface III succeeds Pope Sabinian as the 66th pope, but dies the same year on February 19th.", "613": "613 is the year that the Abbey of St. Gall is founded.", "617": "617 is the year that Sigehbert I becomes king of Essex.", "619": "619 is the year that the calculation of the Chinese calendar begins to use true motions of the sun and moon modeled using two offset opposing parabolas.", "631": "631 is the year that the Battle of Wogastisburg is fought between the Slavs led by Samo, and the Franks led by their king, Dagobert I.", "641": "641 is the year that Byzantine Emperor Heraclius dies on February 11th.", "643": "643 is the year that a Chinese Tang ambassador is sent to the North Indian Empire.", "647": "647 is the year that the first Muslim invasion of North Africa led by Uthman ibn Affan of the Rashidun Caliphate.", "653": "653 is the year that Pope Martin I is arrested on orders of Byzantine Emperor Constans II.", "659": "659 is the year that nothing remarkable happened.", "661": "661 is the year that the Imperial fleet of Japan invades Kyūshū by the order of Empress Saimei.", "673": "673 is the year that the city of Ely, England is founded.", "677": "677 is the year that the Earth probably went around the Sun.", "683": "683 is the year that Emperor Temmu of Japan decrees that copper coins must be used instead of silver coins.", "691": "691 is the year that Wilfrid, Bishop of Northumbria, is expelled to Mercia.", "701": "701 is the year that Wittiza succeeds his grandfather Ergica as king of the Visigoths.", "709": "709 is the year that Saelred becomes king of Essex.", "719": "719 is the year that the West Saxon monk Winifrid is sent by Pope Gregory II, who gives him the name Boniface, to evangelize in Germany and reorganize the church there.", "727": "727 is the year that Umayyad troops under Abdallah al-Battal and Mu'awiyah ibn Hisham raze Gangra and unsuccessfully besiege Nicaea.", "733": "733 is the year that nothing remarkable happened.", "739": "739 is the year that Theodatus Ursus appointed Consul of the Roman Empire and Magister militum.", "743": "743 is the year that Constantine V re-ascends the throne of the Byzantine Empire.", "757": "757 is the year that the Battle of Suiyang is fought.", "761": "761 is the year that Bridei V succeeds Onuist as king of the Picts.", "769": "769 is the year that the Monastery of Tallaght is founded by Máel Ruain.", "773": "773 is the year that the concept of the number zero is introduced to the city of Baghdad.", "787": "787 is the year that Conall succeeds Drest as king of the Picts.", "797": "797 is the year that Irene of Athens orders her son, Byzantine Emperor Constantine VI, captured and deposed on July 17th.", "809": "809 is the year that the Bulgars capture Sofia.", "811": "811 is the year that Michael I Rangabe is declared Byzantine emperor; Stauracius retires to a monastery on October 1st.", "821": "821 is the year that First recorded session of the Parliament of Croatia.", "823": "823 is the year that Emperor Junna ascends to the throne of Japan.", "827": "827 is the year that Pope Gregory IV succeeds Pope Valentine as the 101st pope (date unclear).", "829": "829 is the year that the Saracens ravage the coast of Dalmatia.", "839": "839 is the year that Uen is succeeded by Uurad as king of the Picts.", "853": "853 is the year that Tuan Ch'eng-Shih publishes Miscellaneous Offerings from Yu-yang in China.", "857": "857 is the year that the Vikings raid Dorestad.", "859": "859 is the year that the Russian city of Novgorod is first mentioned in the chronicles.", "863": "863 is the year that Byzantine missionaries Saints Cyril and Methodius come to Great Moravia upon a request of Prince Rastislav.", "877": "877 is the year that Hincmar crowns Louis the Stammerer King of the West Franks in the church of Compiegne on December 8th.", "881": "881 is the year that St. Cäcilien, Cäcilienstraße, Cologne is founded as a college for women.", "883": "883 is the year that Monte Cassino is sacked and burned down by the Saracens.", "887": "887 is the year that Arnulf of Carinthia ascends to the throne of Eastern Francia (modern Germany).", "907": "907 is the year that the Wuyue State is founded by Qian Liu in Hangzhou.", "911": "911 is the year that Pope Anastasius III succeeds Pope Sergius III as the 120th pope on April NaNth.", "919": "919 is the year that the Great Yue Kingdom changes its name to the Southern Han.", "929": "929 is the year that Pope Stephen VII succeeds Pope Leo VI.", "937": "937 is the year that the Wu State is taken from within by Li Bian, who then founds the Southern Tang Kingdom.", "941": "941 is the year that Oda the Severe becomes Archbishop of Canterbury.", "947": "947 is the year that Masudi completes first version of The Meadows of Gold and Mines of Gems, an important history book.", "953": "953 is the year that Póvoa de Varzim, Portugal appears, for the first time, as a Portuguese town under the name Villa Euracini.", "967": "967 is the year that Dado becomes count of Pombia.", "971": "971 is the year that Basileus John Tzimisces defeats Sviatoslav I of Kiev in the Fifth Rus'-Byzantine War (see Battle of Dorostolon).", "977": "977 is the year that Saint Æthelwold of Winchester, Bishop of Winchester, rebuilds the western end of the Old Minster, Winchester, with twin towers and no apses.", "983": "983 is the year that the Khazar Empire ends.", "991": "991 is the year that Sweyn I of Denmark recovers his throne.", "997": "997 is the year that Saint Adalbert of Prague is sent to Prussia by Boleslaus I of Poland."}